RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_mdma.c
        /* configure endianness and priority */
        MDMA_CHXCTL0(channelx) &= ~(MDMA_CHXCTL0_BES | MDMA_CHXCTL0_HWES | MDMA_CHXCTL0_WES | MDMA_CHXCTL0_PRIO);
        MDMA_CHXCTL0(channelx) |= (uint32_t)((init_struct->endianness & (MDMA_CHXCTL0_BES | MDMA_CHXCTL0_HWES | MDMA_CHXCTL0_WES)) |
                                             (init_struct->priority & MDMA_CHXCTL0_PRIO));

        /* configure MDMA transfer width, memory transfer width, channel priority */
        MDMA_CHXCFG(channelx) = (uint32_t)((init_struct->data_alignment & (MDMA_CHXCFG_PKEN | MDMA_CHXCFG_PAMOD)) |
                                           (init_struct->dest_burst & MDMA_CHXCFG_DBURST) | (init_struct->dest_data_size & MDMA_CHXCFG_DWIDTH) | \
                                           (init_struct->dest_inc & (MDMA_CHXCFG_DIMOD | MDMA_CHXCFG_DIOS)) | (init_struct->source_burst & MDMA_CHXCFG_SBURST) |
                                           (init_struct->source_data_size & MDMA_CHXCFG_SWIDTH) | \
                                           (init_struct->source_inc & (MDMA_CHXCFG_SIMOD | MDMA_CHXCFG_SIOS)) | (init_struct->trans_trig_mode & MDMA_CHXCFG_TRIGMOD) | \
                                           ((init_struct->buff_trans_len << CHXCFG_BTLEN_OFFSET) & MDMA_CHXCFG_BTLEN) | (init_struct->bufferable_write_mode & MDMA_CHXCFG_BWMOD));
        /* configure mask address, mask data */
        MDMA_CHXMADDR(channelx) = init_struct->mask_addr;
        MDMA_CHXMDATA(channelx) = init_struct->mask_data;

        /* configure source address */
        MDMA_CHXSADDR(channelx) = init_struct->source_addr;
        /* configure destination address */
        MDMA_CHXDADDR(channelx) = init_struct->destination_addr;

        /* configure block transfer byte number */
        if(MDMA_BUFFER_TRANSFER == init_struct->trans_trig_mode) {
            MDMA_CHXBTCFG(channelx) = (init_struct->tbytes_num_in_block & MDMA_CHXBTCFG_TBNUM);
        } else if(MDMA_BLOCK_TRANSFER == init_struct->trans_trig_mode) {
            MDMA_CHXBTCFG(channelx) = (init_struct->tbytes_num_in_block & MDMA_CHXBTCFG_TBNUM);
        } else if(MDMA_MULTI_BLOCK_TRANSFER == init_struct->trans_trig_mode) {
            MDMA_CHXBTCFG(channelx) &= ~MDMA_CHXBTCFG_TBNUM;
            MDMA_CHXBTCFG(channelx) |= (init_struct->tbytes_num_in_block & MDMA_CHXBTCFG_TBNUM);
        } else if(MDMA_COMPLETE_TRANSFER == init_struct->trans_trig_mode) {
            MDMA_CHXBTCFG(channelx) &= ~MDMA_CHXBTCFG_TBNUM;
            MDMA_CHXBTCFG(channelx) |= (init_struct->tbytes_num_in_block & MDMA_CHXBTCFG_TBNUM);
        } else {
            /* illegal parameters */
        }

        /* configure request source */
        MDMA_CHXCFG(channelx) &= ~MDMA_CHXCFG_SWREQMOD;
        if(MDMA_REQUEST_SW == init_struct->request) {
            MDMA_CHXCFG(channelx) |= MDMA_CHXCFG_SWREQMOD;
        } else {
            MDMA_CHXCTL1(channelx) &= ~MDMA_CHXCTL1_TRIGSEL;
            MDMA_CHXCTL1(channelx) |= init_struct->request;
        }

        /* configure bus type for source and destination */
        MDMA_CHXCTL1(channelx) &= ~(MDMA_CHXCTL1_SBSEL | MDMA_CHXCTL1_DBSEL);
        MDMA_CHXCTL1(channelx) |= (init_struct->source_bus | init_struct->destination_bus);
    }
}

/*!
    \brief      configure MDMA buffer/block transfer mode (API_ID(0x0007U))
    \param[in]  channelx: specify which MDMA channel is initialized
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  saddr: source address, ranges from 0x00000000 to 0xFFFFFFFF
    \param[in]  daddr: destination address, ranges from 0x00000000 to 0xFFFFFFFF
    \param[in]  tbnum: number of bytes to transfer, ranges from 0x00000000 to 0x00010000
    \param[out] none
    \retval     none
*/
void mdma_buffer_block_mode_config(mdma_channel_enum channelx, uint32_t saddr, uint32_t daddr, uint32_t tbnum)
{
    MDMA_CHXSADDR(channelx) = saddr;
    MDMA_CHXDADDR(channelx) = daddr;
    MDMA_CHXBTCFG(channelx) &= ~MDMA_CHXBTCFG_TBNUM;
    MDMA_CHXBTCFG(channelx) |= (uint32_t)(tbnum & MDMA_CHXBTCFG_TBNUM);
}

/*!
    \brief      configure MDMA multi block transfer mode (API_ID(0x0008U))
    \param[in]  channelx: specify which MDMA channel is initialized
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  tbnum: number of bytes to transfer in block, range from 0x00000000 to 0x00000FFF
    \param[in]  block_init_struct: the data needed to initialize MDMA multi block mode,
                the member values are shown as below:
                  block_num: multi block number, ranges from 0x00000000 to 0x00000FFF
                  saddr_update_val: source address update value, ranges from 0x0000 to 0xFFFF
                  dstaddr_update_val: destination address update value, ranges from 0x0000 to 0xFFFF
                  saddr_update_dir: source address update direction, UPDATE_DIR_INCREASE, UPDATE_DIR_DECREASE
                  dstaddr_update_dir: destination address update direction, UPDATE_DIR_INCREASE, UPDATE_DIR_DECREASE
    \param[out] none
    \retval     none
*/
void mdma_multi_block_mode_config(mdma_channel_enum channelx, uint32_t tbnum, mdma_multi_block_parameter_struct *block_init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(block_init_struct)) {
        fw_debug_report_err(DMA_MODULE_ID, API_ID(0x0008U), ERR_PARAM_POINTER);
    } else
#endif
    {
        uint32_t blockoffset;

        MDMA_CHXBTCFG(channelx) = (uint32_t)(((block_init_struct->block_num << CHXBTCFG_BRNUM_OFFSET) & MDMA_CHXBTCFG_BRNUM) | (tbnum & MDMA_CHXBTCFG_TBNUM));

        MDMA_CHXMBADDRU(channelx) &= ~(MDMA_CHXMBADDRU_SADDRUV | MDMA_CHXMBADDRU_DADDRUV);
        /* if block source address offset is negative, set the block repeat source address update mode to decrement */
        if(UPDATE_DIR_DECREASE == block_init_struct->saddr_update_dir) {
            MDMA_CHXBTCFG(channelx) |= MDMA_CHXBTCFG_SADDRUM;
            /* write new chxmbaddru register value: source repeat block offset */
            blockoffset = (uint32_t)block_init_struct->saddr_update_val;
            MDMA_CHXMBADDRU(channelx) |= (uint32_t)(blockoffset & MDMA_ADDRESS_MASK);
        } else {
            MDMA_CHXBTCFG(channelx) &= ~MDMA_CHXBTCFG_SADDRUM;
            /* write new chxmbaddru register value: source repeat block offset */
            MDMA_CHXMBADDRU(channelx) |= (uint32_t)(((uint32_t)block_init_struct->saddr_update_val) & MDMA_ADDRESS_MASK);
        }

        if(UPDATE_DIR_DECREASE == block_init_struct->dstaddr_update_dir) {
            MDMA_CHXBTCFG(channelx) |= MDMA_CHXBTCFG_DADDRUM;
            /* write new chxmbaddru register value: destination repeat block offset */
            blockoffset = (uint32_t)block_init_struct->dstaddr_update_val;
            MDMA_CHXMBADDRU(channelx) |= (uint32_t)((blockoffset & MDMA_ADDRESS_MASK) << CHXMBADDRU_DADDRUV_OFFSET);
        } else {
            MDMA_CHXBTCFG(channelx) &= ~MDMA_CHXBTCFG_DADDRUM;
            /* write new chxmbaddru register value: destination repeat block offset */
            MDMA_CHXMBADDRU(channelx) |= (uint32_t)((((uint32_t)block_init_struct->dstaddr_update_val) & MDMA_ADDRESS_MASK) << CHXMBADDRU_DADDRUV_OFFSET);
        }
    }
}

/*!
    \brief      create MDMA link list node (API_ID(0x0009U))
    \param[in]  channelx: specify which MDMA channel is initialized
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] node: link node structure to create, members of the structure are shown as below:
                  chxcfg_reg: channel configure register
                  chxbtcfg_reg: channel block transfer configure register
                  chxsaddr_reg: channel source address register
                  chxdaddr_reg: channel destination address register
                  chxmbaddru_reg: channel multi-block address update register
                  chxladdr_reg: channel link address register
                  chxctl1_reg: channel control register 1
                  chxmaddr_reg: channel mask address register
                  chxmdata_reg: channel mask data register
    \param[in]  block_init_struct: mdma multi block structure, members of the structure and the member values are shown as below:
                  block_num: multi-block number, ranges from 0x00000000 to 0x00000FFF
                  saddr_update_val: source address update value, ranges from 0x0000 to 0xFFFF
                  dstaddr_update_val: destination address update value, ranges from 0x0000 to 0xFFFF
                  saddr_update_dir: source address update direction, UPDATE_DIR_INCREASE, UPDATE_DIR_DECREASE
                  dstaddr_update_dir: destination address update direction, UPDATE_DIR_INCREASE, UPDATE_DIR_DECREASE
    \param[in]  init_struct: the data needed to initialize MDMA single data mode,
                members of the structure and the member values are shown as below:
                  request: MDMA_REQUEST_x, x is the type of request
                  trans_trig_mode: MDMA_BUFFER_TRANSFER, MDMA_BLOCK_TRANSFER, MDMA_MULTI_BLOCK_TRANSFER, MDMA_COMPLETE_TRANSFER
                  priority: MDMA_PRIORITY_LOW, MDMA_PRIORITY_MEDIUM, MDMA_PRIORITY_HIGH, MDMA_PRIORITY_ULTRA_HIGH
                  endianness: MDMA_LITTLE_ENDIANNESS, MDMA_BYTE_ENDIANNESS_EXCHANGE, MDMA_HALFWORD_ENDIANNESS_EXCHANGE, MDMA_WORD_ENDIANNESS_EXCHANGE
                  source_inc: MDMA_SOURCE_INCREASE_DISABLE, MDMA_SOURCE_INCREASE_8BIT, MDMA_SOURCE_INCREASE_16BIT, MDMA_SOURCE_INCREASE_32BIT, MDMA_SOURCE_INCREASE_64BIT,
                              MDMA_SOURCE_DECREASE_8BIT, MDMA_SOURCE_DECREASE_16BIT, MDMA_SOURCE_DECREASE_32BIT, MDMA_SOURCE_DECREASE_64BIT
                  dest_inc: MDMA_DESTINATION_INCREASE_DISABLE, MDMA_DESTINATION_INCREASE_8BIT, MDMA_DESTINATION_INCREASE_16BIT, MDMA_DESTINATION_INCREASE_32BIT, MDMA_DESTINATION_INCREASE_64BIT,
                            MDMA_DESTINATION_DECREASE_8BIT, MDMA_DESTINATION_DECREASE_16BIT, MDMA_DESTINATION_DECREASE_32BIT, MDMA_DESTINATION_DECREASE_64BIT
                  source_data_size: MDMA_SOURCE_DATASIZE_8BIT, MDMA_SOURCE_DATASIZE_16BIT, MDMA_SOURCE_DATASIZE_32BIT, MDMA_SOURCE_DATASIZE_64BIT
                  dest_data_size: MDMA_DESTINATION_DATASIZE_8BIT, MDMA_DESTINATION_DATASIZE_16BIT, MDMA_DESTINATION_DATASIZE_32BIT, MDMA_DESTINATION_DATASIZE_64BIT
                  data_alignment: MDMA_DATAALIGN_PKEN, MDMA_DATAALIGN_RIGHT, MDMA_DATAALIGN_RIGHT_SIGNED, MDMA_DATAALIGN_LEFT
                  buff_trans_len: the number of bytes to be transferred is (buff_trans_len+1), buff_trans_len ranges from 0 to 127
                  source_burst: MDMA_SOURCE_BURST_SINGLE, MDMA_SOURCE_BURST_2BEATS, MDMA_SOURCE_BURST_4BEATS, MDMA_SOURCE_BURST_8BEATS, MDMA_SOURCE_BURST_16BEATS,
                                MDMA_SOURCE_BURST_32BEATS, MDMA_SOURCE_BURST_64BEATS, MDMA_SOURCE_BURST_128BEATS
                  dest_burst: MDMA_DESTINATION_BURST_SINGLE, MDMA_DESTINATION_BURST_2BEATS, MDMA_DESTINATION_BURST_4BEATS, MDMA_DESTINATION_BURST_8BEATS, MDMA_DESTINATION_BURST_16BEATS,
                              MDMA_DESTINATION_BURST_32BEATS, MDMA_DESTINATION_BURST_64BEATS, MDMA_DESTINATION_BURST_128BEATS
                  mask_addr: mask address, ranges from 0x00000000 to 0xFFFFFFFF
                  mask_data: mask data, ranges from 0x00000000 to 0xFFFFFFFF
                  source_addr: source address, ranges from 0x00000000 to 0xFFFFFFFF
                  destination_addr: destination address, ranges from 0x00000000 to 0xFFFFFFFF
                  tbytes_num_in_block: transfer byte number of a block transfer, ranges from 0x00000000 to 0x0001FFFF
                  source_bus: MDMA_SOURCE_AXI, MDMA_SOURCE_AHB_TCM
                  destination_bus: MDMA_DESTINATION_AXI, MDMA_DESTINATION_AHB_TCM
                  bufferable_write_mode: MDMA_BUFFERABLE_WRITE_ENABLE, MDMA_BUFFERABLE_WRITE_DISABLE
    \retval     none
*/
void mdma_node_create(mdma_link_node_parameter_struct *node, mdma_multi_block_parameter_struct *block_init_struct, mdma_parameter_struct *init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(node)) {
        fw_debug_report_err(DMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(block_init_struct)) {
        fw_debug_report_err(DMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(DMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_POINTER);
    } else
#endif
    {
        uint32_t cfg, blockoffset;

        /* configure channel configure register */
        cfg = (init_struct->data_alignment | init_struct->dest_burst | init_struct->dest_data_size | init_struct->dest_inc | \
               init_struct->source_burst | init_struct->source_data_size | init_struct->source_inc | init_struct->trans_trig_mode | \
               ((init_struct->buff_trans_len << CHXCFG_BTLEN_OFFSET) & MDMA_CHXCFG_BTLEN) | init_struct->bufferable_write_mode);
        node->chxcfg_reg = cfg;

        /* configure channel request source */
        if(MDMA_REQUEST_SW == init_struct->request) {
            node->chxcfg_reg |= MDMA_CHXCFG_SWREQMOD;
        } else {
            node->chxctl1_reg &= ~MDMA_CHXCTL1_TRIGSEL;
            node->chxctl1_reg |= init_struct->request;
        }
        /* configure bus type for source and destination */
        node->chxctl1_reg &= ~(MDMA_CHXCTL1_SBSEL | MDMA_CHXCTL1_DBSEL);
        node->chxctl1_reg |= (init_struct->source_bus | init_struct->destination_bus);

        /* configure channel block transfer configure register */
        cfg = (((block_init_struct->block_num << CHXBTCFG_BRNUM_OFFSET) & MDMA_CHXBTCFG_BRNUM) | (init_struct->tbytes_num_in_block & MDMA_CHXBTCFG_TBNUM));
        node->chxbtcfg_reg = cfg;

        /* configure source address, destination address, mask address and mask data */
        node->chxsaddr_reg = init_struct->source_addr;
        node->chxdaddr_reg = init_struct->destination_addr;
        node->chxmaddr_reg = init_struct->mask_addr;
        node->chxmdata_reg = init_struct->mask_data;

        node->chxmbaddru_reg &= ~(MDMA_CHXMBADDRU_SADDRUV | MDMA_CHXMBADDRU_DADDRUV);
        /* if block source address offset is negative, set the block repeat source address update mode to decrement */
        if(UPDATE_DIR_DECREASE == block_init_struct->saddr_update_dir) {
            node->chxbtcfg_reg |= MDMA_CHXBTCFG_SADDRUM;
            /* write new chxmbaddru register value: source repeat block offset */
            blockoffset = (uint32_t)block_init_struct->saddr_update_val;
            node->chxmbaddru_reg |= (uint32_t)(blockoffset & MDMA_ADDRESS_MASK);
        } else {
            node->chxbtcfg_reg &= ~MDMA_CHXBTCFG_SADDRUM;
            /* write new chxmbaddru register value: source repeat block offset */
            node->chxmbaddru_reg |= (uint32_t)(((uint32_t)block_init_struct->saddr_update_val) & MDMA_ADDRESS_MASK);
        }

        if(UPDATE_DIR_DECREASE == block_init_struct->dstaddr_update_dir) {
            node->chxbtcfg_reg |= MDMA_CHXBTCFG_DADDRUM;
            /* write new chxmbaddru register value: destination repeat block offset */
            blockoffset = (uint32_t)block_init_struct->dstaddr_update_val;
            node->chxmbaddru_reg |= (uint32_t)((blockoffset & MDMA_ADDRESS_MASK) << CHXMBADDRU_DADDRUV_OFFSET);
        } else {
            node->chxbtcfg_reg &= ~MDMA_CHXBTCFG_DADDRUM;
            /* write new chxmbaddru register value: destination repeat block offset */
            node->chxmbaddru_reg |= (uint32_t)((((uint32_t)block_init_struct->dstaddr_update_val) & MDMA_ADDRESS_MASK) << CHXMBADDRU_DADDRUV_OFFSET);
        }

        node->chxladdr_reg = 0U;
        node->reserved = 0U;
    }
}

/*!
    \brief      MDMA add node to link list (API_ID(0x000AU))
    \param[in]  pre_node: previous structure node pointer, members of the structure and the member values are shown as below:
                  chxcfg_reg: channel configure register
                  chxbtcfg_reg: channel block transfer configure register
                  chxsaddr_reg: channel source address register
                  chxdaddr_reg: channel destination address register
                  chxmbaddru_reg: channel multi-block address update register
                  chxladdr_reg: channel link address register
                  chxctl1_reg: channel control register 1
                  chxmaddr_reg: channel mask address register
                  chxmdata_reg: channel mask data register
    \param[in]  new_node: new node pointer, members of the structure and the member values are shown as below:
                  chxcfg_reg: channel configure register
                  chxbtcfg_reg: channel block transfer configure register
                  chxsaddr_reg: channel source address register
                  chxdaddr_reg: channel destination address register
                  chxmbaddru_reg: channel multi-block address update register
                  chxladdr_reg: channel link address register
                  chxctl1_reg: channel control register 1
                  chxmaddr_reg: channel mask address register
                  chxmdata_reg: channel mask data register
    \param[out] none
    \retval     none
*/
void mdma_node_add(mdma_link_node_parameter_struct *pre_node, mdma_link_node_parameter_struct *new_node)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(pre_node)) {
        fw_debug_report_err(DMA_MODULE_ID, API_ID(0x000AU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(new_node)) {
        fw_debug_report_err(DMA_MODULE_ID, API_ID(0x000AU), ERR_PARAM_POINTER);
    } else
#endif
    {
        pre_node->chxladdr_reg = (uint32_t)new_node;
    }
}

/*!
    \brief      MDMA disconnect link list node (API_ID(0x000BU))
    \param[in]  pre_node: previous structure node pointer, members of the structure and the member values are shown as below:
                  chxcfg_reg: channel configure register
                  chxbtcfg_reg: channel block transfer configure register
                  chxsaddr_reg: channel source address register
                  chxdaddr_reg: channel destination address register
                  chxmbaddru_reg: channel multi-block address update register
                  chxladdr_reg: channel link address register
                  chxctl1_reg: channel control register 1
                  chxmaddr_reg: channel mask address register
                  chxmdata_reg: channel mask data register
    \param[in]  unused_node: unused link list node pointer, members of the structure and the member values are shown as below:
                  chxcfg_reg: channel configure register
                  chxbtcfg_reg: channel block transfer configure register
                  chxsaddr_reg: channel source address register
                  chxdaddr_reg: channel destination address register
                  chxmbaddru_reg: channel multi-block address update register
                  chxladdr_reg: channel link address register
                  chxctl1_reg: channel control register 1
                  chxmaddr_reg: channel mask address register
                  chxmdata_reg: channel mask data register
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus mdma_node_delete(mdma_link_node_parameter_struct *pre_node, mdma_link_node_parameter_struct *unused_node)
{
    ErrStatus reval = ERROR;

