RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_mdma.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(pre_node)) {
        fw_debug_report_err(DMA_MODULE_ID, API_ID(0x000BU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(unused_node)) {
        fw_debug_report_err(DMA_MODULE_ID, API_ID(0x000BU), ERR_PARAM_POINTER);
    } else
#endif
    {
        if(pre_node->chxladdr_reg != (uint32_t)unused_node) {
            /* link address unmatched */
            reval = ERROR;
        } else {
            /* link address matched, disconnect the unused node from link list */
            pre_node->chxladdr_reg = 0U;
            reval = SUCCESS;
        }
    }
    return reval;
}

/*!
    \brief      configure MDMA destination base address (API_ID(0x000CU))
    \param[in]  channelx: specify which MDMA channel to set peripheral base address
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  address: destination base address, ranges from 0x00000000 to 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void mdma_destination_address_config(mdma_channel_enum channelx, uint32_t address)
{
    MDMA_CHXDADDR(channelx) = address;
}

/*!
    \brief      configure MDMA source base address (API_ID(0x000DU))
    \param[in]  channelx: specify which MDMA channel to set Memory base address
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  address: source base address, ranges from 0x00000000 to 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void mdma_source_address_config(mdma_channel_enum channelx, uint32_t address)
{
    MDMA_CHXSADDR(channelx) = address;
}

/*!
    \brief      configure MDMA destination bus (API_ID(0x000EU))
    \param[in]  channelx: specify which MDMA channel to set bus
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  bus: destination bus
      \arg        MDMA_DESTINATION_AXI: destination bus is the system bus or AXI bus
      \arg        MDMA_DESTINATION_AHB_TCM: destination bus is AHB bus or TCM
    \param[out] none
    \retval     none
*/
void mdma_destination_bus_config(mdma_channel_enum channelx, uint32_t bus)
{
    MDMA_CHXCTL1(channelx) &= ~MDMA_CHXCTL1_DBSEL;
    MDMA_CHXCTL1(channelx) |= (uint32_t)(bus & MDMA_CHXCTL1_DBSEL);
}

/*!
    \brief      configure MDMA source bus (API_ID(0x000FU))
    \param[in]  channelx: specify which MDMA channel to set bus
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  bus: source bus
      \arg        MDMA_SOURCE_AXI: source bus is the system bus or AXI bus
      \arg        MDMA_SOURCE_AHB_TCM: source bus is AHB bus or TCM
    \param[out] none
    \retval     none
*/
void mdma_source_bus_config(mdma_channel_enum channelx, uint32_t bus)
{
    MDMA_CHXCTL1(channelx) &= ~MDMA_CHXCTL1_SBSEL;
    MDMA_CHXCTL1(channelx) |= (uint32_t)(bus & MDMA_CHXCTL1_SBSEL);
}

/*!
    \brief      configure priority level of MDMA channel (API_ID(0x0010U))
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  priority: priority level of this channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_PRIORITY_LOW: low priority
      \arg        MDMA_PRIORITY_MEDIUM: medium priority
      \arg        MDMA_PRIORITY_HIGH: high priority
      \arg        MDMA_PRIORITY_ULTRA_HIGH: ultra high priority
    \param[out] none
    \retval     none
*/
void mdma_priority_config(mdma_channel_enum channelx, uint32_t priority)
{
    /* configure priority level with mask restriction */
    MDMA_CHXCTL0(channelx) &= ~MDMA_CHXCTL0_PRIO;
    MDMA_CHXCTL0(channelx) |= (uint32_t)(priority & MDMA_CHXCTL0_PRIO);
}

/*!
    \brief      configure endianness of MDMA channel (API_ID(0x0011U))
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  endianness: MDMA endianness
                only one parameter can be selected which is shown as below:
      \arg        MDMA_LITTLE_ENDIANNESS: little endianness preserve
      \arg        MDMA_BYTE_ENDIANNESS_EXCHANGE: exchange the order of the bytes in a half-word
      \arg        MDMA_HALFWORD_ENDIANNESS_EXCHANGE: exchange the order of the half-words in a word
      \arg        MDMA_WORD_ENDIANNESS_EXCHANGE: exchange the order of the words in a double word
    \param[out] none
    \retval     none
*/
void mdma_endianness_config(mdma_channel_enum channelx, uint32_t endianness)
{
    /* configure MDMA endianness with mask restriction */
    MDMA_CHXCTL0(channelx) &= ~(MDMA_CHXCTL0_BES | MDMA_CHXCTL0_HWES | MDMA_CHXCTL0_WES);
    MDMA_CHXCTL0(channelx) |= (uint32_t)(endianness & (MDMA_CHXCTL0_BES | MDMA_CHXCTL0_HWES | MDMA_CHXCTL0_WES));
}

/*!
    \brief      configure data alignment of MDMA channel (API_ID(0x0012U))
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  alignment: MDMA data alignment
                only one parameter can be selected which is shown as below:
      \arg        MDMA_DATAALIGN_PKEN: pack/unpack the source data to match the destination data size
      \arg        MDMA_DATAALIGN_RIGHT: right aligned, padded with 0s (default)
      \arg        MDMA_DATAALIGN_RIGHT_SIGNED: right aligned with sign extended, note: this mode is allowed only if the source data size is smaller than destination data size
      \arg        MDMA_DATAALIGN_LEFT: left aligned, padded with 0s in low bytes position when source data size smaller than destination data size, and only high byte of source is written when source data size larger than destination data size
    \param[out] none
    \retval     none
*/
void mdma_alignment_config(mdma_channel_enum channelx, uint32_t alignment)
{
    /* configure MDMA endianness */
    MDMA_CHXCFG(channelx) &= ~(MDMA_CHXCFG_PKEN | MDMA_CHXCFG_PAMOD);
    MDMA_CHXCFG(channelx) |= (uint32_t)(alignment & (MDMA_CHXCFG_PKEN | MDMA_CHXCFG_PAMOD));
}

/*!
    \brief      configure transfer burst beats of source (API_ID(0x0013U))
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  sbeat: source transfer burst beats
      \arg        MDMA_SOURCE_BURST_SINGLE: single burst
      \arg        MDMA_SOURCE_BURST_2BEATS: 2-beat incrementing burst
      \arg        MDMA_SOURCE_BURST_4BEATS: 4-beat incrementing burst
      \arg        MDMA_SOURCE_BURST_8BEATS: 8-beat incrementing burst
      \arg        MDMA_SOURCE_BURST_16BEATS: 16-beat incrementing burst
      \arg        MDMA_SOURCE_BURST_32BEATS: 32-beat incrementing burst
      \arg        MDMA_SOURCE_BURST_64BEATS: 64-beat incrementing burst
      \arg        MDMA_SOURCE_BURST_128BEATS: 128-beat incrementing burst
    \param[out] none
    \retval     none
*/
void mdma_source_burst_beats_config(mdma_channel_enum channelx, uint32_t sbeat)
{
    /* configure transfer burst beats of source */
    MDMA_CHXCFG(channelx) &= ~MDMA_CHXCFG_SBURST;
    MDMA_CHXCFG(channelx) |= (uint32_t)(sbeat & MDMA_CHXCFG_SBURST);
}

/*!
    \brief      configure transfer burst beats of destination (API_ID(0x0014U))
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in] dbeat: destination transfer burst beats
                only one parameter can be selected which is shown as below:
      \arg        MDMA_DESTINATION_BURST_SINGLE: single burst
      \arg        MDMA_DESTINATION_BURST_2BEATS: 2-beat incrementing burst
      \arg        MDMA_DESTINATION_BURST_4BEATS: 4-beat incrementing burst
      \arg        MDMA_DESTINATION_BURST_8BEATS: 8-beat incrementing burst
      \arg        MDMA_DESTINATION_BURST_16BEATS: 16-beat incrementing burst
      \arg        MDMA_DESTINATION_BURST_32BEATS: 32-beat incrementing burst
      \arg        MDMA_DESTINATION_BURST_64BEATS: 64-beat incrementing burst
      \arg        MDMA_DESTINATION_BURST_128BEATS: 128-beat incrementing burst
    \param[out] none
    \retval     none
*/
void mdma_destination_burst_beats_config(mdma_channel_enum channelx, uint32_t dbeat)
{
    /* configure transfer burst beats of destination */
    MDMA_CHXCFG(channelx) &= ~MDMA_CHXCFG_DBURST;
    MDMA_CHXCFG(channelx) |= (uint32_t)(dbeat & MDMA_CHXCFG_DBURST);
}

/*!
    \brief      configure data size of source (API_ID(0x0015U))
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  swidth: source data size
                only one parameter can be selected which is shown as below:
      \arg        MDMA_SOURCE_DATASIZE_8BIT: data size of source is 8-bit
      \arg        MDMA_SOURCE_DATASIZE_16BIT: data size of source is 16-bit
      \arg        MDMA_SOURCE_DATASIZE_32BIT: data size of source is 32-bit
      \arg        MDMA_SOURCE_DATASIZE_64BIT: data size of source is 64-bit
    \param[out] none
    \retval     none
*/
void mdma_source_width_config(mdma_channel_enum channelx, uint32_t swidth)
{
    /* configure data size of source */
    MDMA_CHXCFG(channelx) &= ~MDMA_CHXCFG_SWIDTH;
    MDMA_CHXCFG(channelx) |= (uint32_t)(swidth & MDMA_CHXCFG_SWIDTH);
}

/*!
    \brief      configure data size of destination (API_ID(0x0016U))
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  dwidth: destination data size
                only one parameter can be selected which is shown as below:
      \arg        MDMA_DESTINATION_DATASIZE_8BIT: data size of destination is 8-bit
      \arg        MDMA_DESTINATION_DATASIZE_16BIT: data size of destination is 16-bit
      \arg        MDMA_DESTINATION_DATASIZE_32BIT: data size of destination is 32-bit
      \arg        MDMA_DESTINATION_DATASIZE_64BIT: data size of destination is 64-bit
    \param[out] none
    \retval     none
*/
void mdma_destination_width_config(mdma_channel_enum channelx, uint32_t dwidth)
{
    /* configure data size of destination */
    MDMA_CHXCFG(channelx) &= ~MDMA_CHXCFG_DWIDTH;
    MDMA_CHXCFG(channelx) |= (uint32_t)(dwidth & MDMA_CHXCFG_DWIDTH);
}

/*!
    \brief      configure source address increment mode (API_ID(0x0017U))
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  sinc: source address increment mode
                only one parameter can be selected which is shown as below:
      \arg        MDMA_SOURCE_INCREASE_DISABLE: no increment
      \arg        MDMA_SOURCE_INCREASE_8BIT: source address is increased by 8-bit
      \arg        MDMA_SOURCE_INCREASE_16BIT: source address is increased by 16-bit
      \arg        MDMA_SOURCE_INCREASE_32BIT: source address is increased by 32-bit
      \arg        MDMA_SOURCE_INCREASE_64BIT: source address is increased by 64-bit
      \arg        MDMA_SOURCE_DECREASE_8BIT: source address is decreased by 8-bit
      \arg        MDMA_SOURCE_DECREASE_16BIT: source address is decreased by 16-bit
      \arg        MDMA_SOURCE_DECREASE_32BIT: source address is decreased by 32-bit
      \arg        MDMA_SOURCE_DECREASE_64BIT: source address is decreased by 64-bit
    \param[out] none
    \retval     none
*/
void mdma_source_increment_config(mdma_channel_enum channelx, uint32_t sinc)
{
    /* configure address increment mode of source */
    MDMA_CHXCFG(channelx) &= ~(MDMA_CHXCFG_SIMOD | MDMA_CHXCFG_SIOS);
    MDMA_CHXCFG(channelx) |= (uint32_t)(sinc & (MDMA_CHXCFG_SIMOD | MDMA_CHXCFG_SIOS));
}

/*!
    \brief      configure destination address increment mode (API_ID(0x0018U))
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  dinc: destination address increment mode
                only one parameter can be selected which is shown as below:
      \arg        MDMA_DESTINATION_INCREASE_DISABLE: no increment
      \arg        MDMA_DESTINATION_INCREASE_8BIT: destination address is increased by 8-bit
      \arg        MDMA_DESTINATION_INCREASE_16BIT: destination address is increased by 16-bit
      \arg        MDMA_DESTINATION_INCREASE_32BIT: destination address is increased by 32-bit
      \arg        MDMA_DESTINATION_INCREASE_64BIT: destination address is increased by 64-bit
      \arg        MDMA_DESTINATION_DECREASE_8BIT: destination address is decreased by 8-bit
      \arg        MDMA_DESTINATION_DECREASE_16BIT: destination address is decreased by 16-bit
      \arg        MDMA_DESTINATION_DECREASE_32BIT: destination address is decreased by 32-bit
      \arg        MDMA_DESTINATION_DECREASE_64BIT: destination address is decreased by 64-bit
    \param[out] none
    \retval     none
*/
void mdma_destination_increment_config(mdma_channel_enum channelx, uint32_t dinc)
{
    /* configure address increment mode of destination */
    MDMA_CHXCFG(channelx) &= ~(MDMA_CHXCFG_DIMOD | MDMA_CHXCFG_DIOS);
    MDMA_CHXCFG(channelx) |= (uint32_t)(dinc & (MDMA_CHXCFG_DIMOD | MDMA_CHXCFG_DIOS));
}

/*!
    \brief      enable MDMA channel bufferable write mode (API_ID(0x0019U))
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     none
*/
void mdma_channel_bufferable_write_enable(mdma_channel_enum channelx)
{
    MDMA_CHXCFG(channelx) |= MDMA_CHXCFG_BWMOD;
}

/*!
    \brief      disable MDMA channel bufferable write mode (API_ID(0x001AU))
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     none
*/
void mdma_channel_bufferable_write_disable(mdma_channel_enum channelx)
{
    MDMA_CHXCFG(channelx) &= ~MDMA_CHXCFG_BWMOD;
}

/*!
    \brief      enable MDMA channel software request (API_ID(0x001BU))
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     none
*/
void mdma_channel_software_request_enable(mdma_channel_enum channelx)
{
    MDMA_CHXCTL0(channelx) |= MDMA_CHXCTL0_SWREQ;
}

/*!
    \brief      enable MDMA channel (API_ID(0x001CU))
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     none
*/
void mdma_channel_enable(mdma_channel_enum channelx)
{
    MDMA_CHXCTL0(channelx) |= MDMA_CHXCTL0_CHEN;
}

/*!
    \brief      disable MDMA channel (API_ID(0x001DU))
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     none
*/
void mdma_channel_disable(mdma_channel_enum channelx)
{
    MDMA_CHXCTL0(channelx) &= ~MDMA_CHXCTL0_CHEN;
}

/*!
    \brief      get MDMA transfer error direction (API_ID(0x001EU))
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     transfer error direction: MDMA_READ_ERROR or MDMA_WRITE_ERROR
*/
uint32_t mdma_transfer_error_direction_get(mdma_channel_enum channelx)
{
    return (uint32_t)(MDMA_CHXSTAT1(channelx) & MDMA_CHXSTAT1_TERRD);
}

/*!
    \brief      get MDMA transfer error address (API_ID(0x001FU))
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     the low 7 bits of the transfer error address
*/
uint32_t mdma_transfer_error_address_get(mdma_channel_enum channelx)
{
    return (uint32_t)(MDMA_CHXSTAT1(channelx) & MDMA_CHXSTAT1_ERRADDR);
}

/*!
    \brief      get MDMA flag (API_ID(0x0020U))
    \param[in]  channelx: specify which MDMA channel to clear flag
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  flag: specify get which flag
                only one parameter can be selected which is shown as below:
      \arg        MDMA_FLAG_ERR: transfer error flag
      \arg        MDMA_FLAG_CHTCF: channel transfer complete flag
      \arg        MDMA_FLAG_MBTCF: multi-block transfer complete flag
      \arg        MDMA_FLAG_BTCF: block transfer complete flag
      \arg        MDMA_FLAG_TCF: buffer transfer complete flag
      \arg        MDMA_FLAG_REQAF: request active flag
      \arg        MDMA_FLAG_LDTERR: link data transfer error flag in the last transfer of the channel
      \arg        MDMA_FLAG_MDTERR: mask data error flag
      \arg        MDMA_FLAG_ASERR: address and size error flag
      \arg        MDMA_FLAG_BZERR: block size error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus mdma_flag_get(mdma_channel_enum channelx, mdma_flag_enum flag)
{
    FlagStatus reval = RESET;

    if(RESET != (MDMA_REG_VAL(channelx, flag) & BIT(MDMA_BIT_POS(flag)))) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}

/*!
    \brief      clear MDMA flag (API_ID(0x0021U))
    \param[in]  channelx: specify which MDMA channel to clear flag
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  flag: specify clear which flag
                only one parameter can be selected which is shown as below:
      \arg        MDMA_FLAG_ERR: transfer error flag
      \arg        MDMA_FLAG_CHTCF: channel transfer complete flag
      \arg        MDMA_FLAG_MBTCF: multi-block transfer complete flag
      \arg        MDMA_FLAG_BTCF: block transfer complete flag
      \arg        MDMA_FLAG_TCF: buffer transfer complete flag
      \arg        MDMA_FLAG_LDTERR: link data transfer error flag in the last transfer of the channel
      \arg        MDMA_FLAG_MDTERR: mask data error flag
      \arg        MDMA_FLAG_ASERR: address and size error flag
      \arg        MDMA_FLAG_BZERR: block size error flag
    \param[out] none
    \retval     none
*/
void mdma_flag_clear(mdma_channel_enum channelx, mdma_flag_enum flag)
{
    uint32_t stat1_reg = MDMA_CHXSTAT1(channelx);
    uint32_t flag_reg = MDMA_REG_VAL(channelx, flag);

    if(stat1_reg == flag_reg) {
        MDMA_CHXSTATC(channelx) |= MDMA_CHXSTATC_ERRC;
    } else {
        MDMA_CHXSTATC(channelx) |= BIT(MDMA_BIT_POS(flag));
    }
}

/*!
    \brief      enable MDMA interrupt (API_ID(0x0022U))
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  interrupt: specify which interrupt to enable
                one or more parameters can be selected which are shown as below:
      \arg        MDMA_INT_ERR: transfer error interrupt
      \arg        MDMA_INT_CHTC: channel transfer complete interrupt
      \arg        MDMA_INT_MBTC: multi-block transfer complete interrupt
      \arg        MDMA_INT_BTC: block transfer complete interrupt
      \arg        MDMA_INT_TC: buffer transfer complete interrupt
    \param[out] none
    \retval     none
*/
void mdma_interrupt_enable(mdma_channel_enum channelx, uint32_t interrupt)
{
    MDMA_CHXCTL0(channelx) |= (uint32_t)(interrupt & MDMA_INT_EN_MASK);
}

/*!
    \brief      disable MDMA interrupt (API_ID(0x0023U))
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  interrupt: specify which interrupt to disable
                one or more parameters can be selected which are shown as below:
      \arg        MDMA_INT_ERR: transfer error interrupt
      \arg        MDMA_INT_CHTC: channel transfer complete interrupt
      \arg        MDMA_INT_MBTC: multi-block transfer complete interrupt
      \arg        MDMA_INT_BTC: block transfer complete interrupt
      \arg        MDMA_INT_TC: buffer transfer complete interrupt
    \param[out] none
    \retval     none
*/
void mdma_interrupt_disable(mdma_channel_enum channelx, uint32_t interrupt)
{
    MDMA_CHXCTL0(channelx) &= ~(uint32_t)(interrupt & MDMA_INT_EN_MASK);
}

/*!
    \brief      get MDMA interrupt flag (API_ID(0x0024U))
    \param[in]  channelx: specify which MDMA channel to get flag
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  int_flag: specify get which flag
                only one parameter can be selected which is shown as below:
      \arg        MDMA_INT_FLAG_ERR: transfer error interrupt flag
      \arg        MDMA_INT_FLAG_CHTCF: channel transfer complete interrupt flag
      \arg        MDMA_INT_FLAG_MBTCF: multi-block transfer complete interrupt flag
      \arg        MDMA_INT_FLAG_BTCF: block transfer complete interrupt flag
      \arg        MDMA_INT_FLAG_TCF: buffer transfer complete interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus mdma_interrupt_flag_get(mdma_channel_enum channelx, mdma_interrupt_flag_enum int_flag)
{
    FlagStatus reval = RESET;
    uint32_t interrupt_enable = 0U, interrupt_flag = 0U;

    /* get the status of interrupt enable bit */
    interrupt_enable = (MDMA_REG_VAL(channelx, int_flag) & BIT(MDMA_BIT_POS(int_flag)));
    /* get the status of interrupt flag */
    interrupt_flag = (MDMA_REG_VAL2(channelx, int_flag) & BIT(MDMA_BIT_POS2(int_flag)));

    if((0U != interrupt_enable) && (0U != interrupt_flag)) {
        reval = SET;
    } else {
        /* do nothing */
    }
    return reval;
}

/*!
    \brief      clear MDMA interrupt flag (API_ID(0x0025U))
    \param[in]  channelx: specify which MDMA channel to clear flag
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  int_flag: specify clear which flag
                only one parameter can be selected which is shown as below:
      \arg        MDMA_INT_FLAG_ERR: transfer error interrupt flag
      \arg        MDMA_INT_FLAG_CHTCF: channel transfer complete interrupt flag
      \arg        MDMA_INT_FLAG_MBTCF: multi-block transfer complete interrupt flag
      \arg        MDMA_INT_FLAG_BTCF: block transfer complete interrupt flag
      \arg        MDMA_INT_FLAG_TCF: buffer transfer complete interrupt flag
    \param[out] none
    \retval     none
*/
void mdma_interrupt_flag_clear(mdma_channel_enum channelx, mdma_interrupt_flag_enum int_flag)
{
    MDMA_CHXSTATC(channelx) |= BIT(MDMA_BIT_POS2(int_flag));
}
